---
kind: method
id: M:Autodesk.Revit.DB.FailureMessageKey.GetHashCode
source: html/eb2ac3fc-2b19-0418-d54d-f71b7caf0bf5.htm
---
# Autodesk.Revit.DB.FailureMessageKey.GetHashCode Method

Gets the integer value of the id as hash code

## Syntax (C#)
```csharp
public override int GetHashCode()
```